Autodesk.Revit.DB.Events.ViewPrintingEventArgs.GetSettings
Get the print settings of the active printing session.
Since:
2017

Autodesk.Revit.DB.Events.ViewPrintingEventArgs.View
The view to be printed.
Since:
2010

Autodesk.Revit.DB.Events.ViewPrintingEventArgs.TotalViews
The number of all views being printed.
Since:
2010

Autodesk.Revit.DB.Events.ViewPrintingEventArgs.Index
The index of the view being printed out of the set of all views being printed.
Remarks:
The index is zero-based. When a single view is being printed, this value should be 0.
Since:
2010

Autodesk.Revit.DB.Events.ViewPrintingEventArgs
The event arguments used by the ViewPrinting event.
Since:
2010